УРВ_файловая/src/DataProcessors/ЗагрузкаЗаданийURMExchange/ЗагрузкаЗаданийURMExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаЗаданийURMExchange</name>
</mdclass:DataProcessor>

УРВ_файловая/src/InformationRegisters/ОбъектыURMExchange/ОбъектыURMExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыURMExchange</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СрокС</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокПо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Создан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>documentGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/DataProcessors/ЗагрузкаЗаданийURMExchange/ObjectModule.bsl
#Область Загрузка_Документов
Процедура ОбновитьСписокЗаданий() Экспорт
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	ОбъектыURMExchange.documentGUID КАК documentGUID,
	                       |	ОбъектыURMExchange.Контрагент КАК Контрагент,
	                       |	ОбъектыURMExchange.Пользователь КАК Пользователь,
	                       |	ОбъектыURMExchange.Проект КАК Проект,
	                       |	ОбъектыURMExchange.Комментарий КАК Комментарий,
	                       |	ОбъектыURMExchange.СрокС КАК СрокС,
	                       |	ОбъектыURMExchange.СрокПо КАК СрокПО,
	                       |	ОбъектыURMExchange.КрайнийСрок КАК КрайнийСрок,
	                       |	ОбъектыURMExchange.ПлановаяТрудоемкость КАК ПлановаяТрудоемкость,
	                       |	ОбъектыURMExchange.Состояние КАК Состояние,
	                       |	ОбъектыURMExchange.Наименование КАК Наименование,
	                       |	ОбъектыURMExchange.Дата КАК Дата,
	                       |	ОбъектыURMExchange.Номер КАК Номер
	                       |ИЗ
	                       |	РегистрСведений.ОбъектыURMExchange КАК ОбъектыURMExchange
	                       |ГДЕ
	                       |	НЕ ОбъектыURMExchange.Создан" );
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаписейЖурнала = Неопределено;
		
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанныхДокумента = URMExchangeСервер.ПолучитьДанныеПоGUID(Выборка.Проект,Выборка.Контрагент,Выборка.Пользователь, Выборка.documentGUID);
		
		Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента.Проект) Тогда
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание "+ СокрЛП(Выборка.documentGUID)+" невозможно,проекта с GUID "+ СокрЛП(Выборка.Проект)+" нет в базе", МассивЗаписейЖурнала);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента.Контрагент) Тогда
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание "+ СокрЛП(Выборка.documentGUID)+" невозможно,контрагента с GUID "+ СокрЛП(Выборка.Контрагент)+" нет в базе", МассивЗаписейЖурнала);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента.Пользователь) Тогда
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание "+ СокрЛП(Выборка.documentGUID)+" невозможно,пользователя с GUID "+ СокрЛП(Выборка.Пользователь)+" нет в базе", МассивЗаписейЖурнала);
			Продолжить;
		КонецЕсли;
		
		
		НачатьТранзакцию();
		
		Если ЗначениеЗаполнено(СтруктураДанныхДокумента.ДокументЗадание) Тогда
			ОбъектЗадание = СтруктураДанныхДокумента.ДокументЗадание.ПолучитьОбъект();
		Иначе
			ОбъектЗадание  = Документы.Задание.СоздатьДокумент();
		КонецеСли;	
		ЗаполнитьЗначенияСвойств(ОбъектЗадание,Выборка);
		ОбъектЗадание.Сотрудник  = СтруктураДанныхДокумента.Пользователь;
		ОбъектЗадание.Контрагент = СтруктураДанныхДокумента.Контрагент;
		ОбъектЗадание.Проект     = СтруктураДанныхДокумента.Проект;
		ОбъектЗадание.GUIDОБД    = Выборка.documentGUID;
		
		Попытка
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			ОбъектЗадание.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);
			
			ИзменитьЗаписьРегистраСведений(Выборка.documentGUID);
		Исключение
			ОтменитьТранзакцию();
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание  "+ СокрЛП(Выборка.documentGUID)+" невозможно.", МассивЗаписейЖурнала);
		КонецПопытки;
			
    КонецЦикла;
						
КонецПроцедуры	

#КонецОбласти

#Область Служебные_Функции
Процедура Сообщить__Ж(ИмяСобытия, ШаблонСообщения, МассивЗаписейЖурнала, Знач УровеньЖурнала = Неопределено) Экспорт
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурнала, , ,ШаблонСообщения)	
КонецПроцедуры

Процедура ИзменитьЗаписьРегистраСведений(documentGUID)
	НаборЗаписей = РегистрыСведений.ОбъектыURMExchange.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.documentGUID.Установить(documentGUID);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись_ из НаборЗаписей Цикл
		Запись_.Создан = Истина;
	КонецЦикла;
	
	Попытка 
		НаборЗаписей.Прочитать();
	Исключение
		Сообщить__Ж("Изменение записи регистра сведений ""ОбъектыURMExchange""",ОписаниеОшибки(),Неопределено);
	КонецПопытки;	
КонецПроцедуры	
#КонецОбласти
